Revit 2026 API

# FaceSilhouetteNode Methods

---

The FaceSilhouetteNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFace | Returns the Face object corresponding to the node. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetInstanceTransform | Returns instance transform of the object being drawn. (Inherited from FaceDetailNode) |
|  | GetLinkTransform | Returns link transform of the object being drawn. (Inherited from FaceDetailNode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FaceSilhouetteNode Class

Autodesk.Revit.DB Namespace